Revit 2024 API
TextElement.VerticalAlignment Property
 Vertical alignment of the text.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public VerticalTextAlignment VerticalAlignment { get; set; }
Visual Basic
Public Property VerticalAlignment As VerticalTextAlignment
	Get
	Set
Visual C++
public:
property VerticalTextAlignment VerticalAlignment {
	VerticalTextAlignment get ();
	void set (VerticalTextAlignment value);
}
Remarks
 The vertical alignment determines the way text is positioned as the text height changes.
For Top-aligned text the top of the text will remain in place.
For Middle-aligned text the horizontal center line of the text will remain in place.
For Bottom-aligned text the bottom of the text will remain in place.
 Changing this property will not affect the position of the text element.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
TextElement Class
Autodesk.Revit.DB Namespace